In [1]:
import pandas as pd

In [85]:
teste_01 ={ "NOME": [
            "Jefferson",
            "Rayssa",
            "Jonas",
            "Juliana",
            "Herverton"
        ],
        "IDADE": [29, 25, 27, 24, 24],
        "SEXO": ["M", "F", "M", "F", "M"],
}
teste_01

{'NOME': ['Jefferson', 'Rayssa', 'Jonas', 'Juliana', 'Herverton'],
 'IDADE': [29, 25, 27, 24, 24],
 'SEXO': ['M', 'F', 'M', 'F', 'M']}

In [88]:
df = pd.DataFrame(teste_01)
df

        NOME  IDADE SEXO
0  Jefferson     29    M
1     Rayssa     25    F
2      Jonas     27    M
3    Juliana     24    F
4  Herverton     24    M

- 1
    #### Agora iremos fazer uma nova tabela teste com as idades  como formato de str ou string.
        - A ideia é fazer uma stringa, separar e converter em algum número.

In [89]:
teste_02 ={ "NOME": [
            "Jefferson",
            "Rayssa",
            "Jonas",
            "Juliana",
            "Herverton"
        ],
        "IDADE": ['29 idade', '25 idade', '27 idade', '24 idade', '24 idade'],
        "SEXO": ["M", "F", "M", "F", "M"],
}
teste_02

{'NOME': ['Jefferson', 'Rayssa', 'Jonas', 'Juliana', 'Herverton'],
 'IDADE': ['29 idade', '25 idade', '27 idade', '24 idade', '24 idade'],
 'SEXO': ['M', 'F', 'M', 'F', 'M']}

In [90]:
df = pd.DataFrame(teste_02)
df

        NOME     IDADE SEXO
0  Jefferson  29 idade    M
1     Rayssa  25 idade    F
2      Jonas  27 idade    M
3    Juliana  24 idade    F
4  Herverton  24 idade    M

- 1.2
    #### Verificar os tipos de dados para só então poder trabaljhar com os dados, e assim converter.

In [91]:
df['IDADE']

0    29 idade
1    25 idade
2    27 idade
3    24 idade
4    24 idade
Name: IDADE, dtype: object

In [92]:
type(df['IDADE'].iloc[0])

str

- 1.3
    #### Início de conversão e trabalho de tratamento dos dados.

In [106]:
df['Nova IDADE'] = df['IDADE'].apply(lambda x: float(x.split(" ")[0]))
df

        NOME     IDADE SEXO  Nova IDADE
0  Jefferson  29 idade    M        29.0
1     Rayssa  25 idade    F        25.0
2      Jonas  27 idade    M        27.0
3    Juliana  24 idade    F        24.0
4  Herverton  24 idade    M        24.0

In [100]:
df['Nova IDADE'].iloc[0]

29.0

In [101]:
type(df['Nova IDADE'][0])

numpy.float64

In [107]:
df['Nova IDADE'].sum()

129.0

In [109]:
df['IDADE']

0    29 idade
1    25 idade
2    27 idade
3    24 idade
4    24 idade
Name: IDADE, dtype: object

In [111]:
df['Nova IDADE']

0    29.0
1    25.0
2    27.0
3    24.0
4    24.0
Name: Nova IDADE, dtype: float64

In [ ]:
df['Teste de idade'] = df['IDADE'].apply(lambda x: )